ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
/*
 * This file is part of Cleanflight.
 *
 * Cleanflight is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * Cleanflight is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with Cleanflight.  If not, see <http://www.gnu.org/licenses/>.
 */

#pragma once

// this file is automatically generated by src/utils/def_generated.pl script
// do not modify this file directly, your changes will be lost

// DEFIO_PORT_<port>_USED_MASK is bitmask of used pins on target
// DEFIO_PORT_<port>_USED_COUNT is count of used pins on target

#if defined(TARGET_IO_PORT0)
# define DEFIO_PORT_0_USED_MASK TARGET_IO_PORT0
# define DEFIO_PORT_0_USED_COUNT BITCOUNT(DEFIO_PORT_0_USED_MASK)
#else
# define DEFIO_PORT_0_USED_MASK 0
# define DEFIO_PORT_0_USED_COUNT 0
#endif
#define DEFIO_PORT_0_OFFSET (0)

#if defined(TARGET_IO_PORT1)
# define DEFIO_PORT_1_USED_MASK TARGET_IO_PORT1
# define DEFIO_PORT_1_USED_COUNT BITCOUNT(DEFIO_PORT_1_USED_MASK)
#else
# define DEFIO_PORT_1_USED_MASK 0
# define DEFIO_PORT_1_USED_COUNT 0
#endif
#define DEFIO_PORT_1_OFFSET (DEFIO_PORT_0_USED_COUNT)

#if defined(TARGET_IO_PORT2)
# define DEFIO_PORT_2_USED_MASK TARGET_IO_PORT2
# define DEFIO_PORT_2_USED_COUNT BITCOUNT(DEFIO_PORT_2_USED_MASK)
#else
# define DEFIO_PORT_2_USED_MASK 0
# define DEFIO_PORT_2_USED_COUNT 0
#endif
#define DEFIO_PORT_2_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)

#if defined(TARGET_IO_PORT3)
# define DEFIO_PORT_3_USED_MASK TARGET_IO_PORT3
# define DEFIO_PORT_3_USED_COUNT BITCOUNT(DEFIO_PORT_3_USED_MASK)
#else
# define DEFIO_PORT_3_USED_MASK 0
# define DEFIO_PORT_3_USED_COUNT 0
#endif
#define DEFIO_PORT_3_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)

#if defined(TARGET_IO_PORT4)
# define DEFIO_PORT_4_USED_MASK TARGET_IO_PORT4
# define DEFIO_PORT_4_USED_COUNT BITCOUNT(DEFIO_PORT_4_USED_MASK)
#else
# define DEFIO_PORT_4_USED_MASK 0
# define DEFIO_PORT_4_USED_COUNT 0
#endif
#define DEFIO_PORT_4_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)

#if defined(TARGET_IO_PORT5)
# define DEFIO_PORT_5_USED_MASK TARGET_IO_PORT5
# define DEFIO_PORT_5_USED_COUNT BITCOUNT(DEFIO_PORT_5_USED_MASK)
#else
# define DEFIO_PORT_5_USED_MASK 0
# define DEFIO_PORT_5_USED_COUNT 0
#endif
#define DEFIO_PORT_5_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)

#if defined(TARGET_IO_PORT6)
# define DEFIO_PORT_6_USED_MASK TARGET_IO_PORT6
# define DEFIO_PORT_6_USED_COUNT BITCOUNT(DEFIO_PORT_6_USED_MASK)
#else
# define DEFIO_PORT_6_USED_MASK 0
# define DEFIO_PORT_6_USED_COUNT 0
#endif
#define DEFIO_PORT_6_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)

#if defined(TARGET_IO_PORT7)
# define DEFIO_PORT_7_USED_MASK TARGET_IO_PORT7
# define DEFIO_PORT_7_USED_COUNT BITCOUNT(DEFIO_PORT_7_USED_MASK)
#else
# define DEFIO_PORT_7_USED_MASK 0
# define DEFIO_PORT_7_USED_COUNT 0
#endif
#define DEFIO_PORT_7_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)

#if defined(TARGET_IO_PORT8)
# define DEFIO_PORT_8_USED_MASK TARGET_IO_PORT8
# define DEFIO_PORT_8_USED_COUNT BITCOUNT(DEFIO_PORT_8_USED_MASK)
#else
# define DEFIO_PORT_8_USED_MASK 0
# define DEFIO_PORT_8_USED_COUNT 0
#endif
#define DEFIO_PORT_8_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)

#if defined(TARGET_IO_PORT9)
# define DEFIO_PORT_9_USED_MASK TARGET_IO_PORT9
# define DEFIO_PORT_9_USED_COUNT BITCOUNT(DEFIO_PORT_9_USED_MASK)
#else
# define DEFIO_PORT_9_USED_MASK 0
# define DEFIO_PORT_9_USED_COUNT 0
#endif
#define DEFIO_PORT_9_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)

#if defined(TARGET_IO_PORT14)
# define DEFIO_PORT_14_USED_MASK TARGET_IO_PORT14
# define DEFIO_PORT_14_USED_COUNT BITCOUNT(DEFIO_PORT_14_USED_MASK)
#else
# define DEFIO_PORT_14_USED_MASK 0
# define DEFIO_PORT_14_USED_COUNT 0
#endif
#define DEFIO_PORT_14_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)

#if defined(TARGET_IO_PORT15)
# define DEFIO_PORT_15_USED_MASK TARGET_IO_PORT15
# define DEFIO_PORT_15_USED_COUNT BITCOUNT(DEFIO_PORT_15_USED_MASK)
#else
# define DEFIO_PORT_15_USED_MASK 0
# define DEFIO_PORT_15_USED_COUNT 0
#endif
#define DEFIO_PORT_15_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)

#if defined(TARGET_IO_PORTA)
# define DEFIO_PORT_A_USED_MASK TARGET_IO_PORTA
# define DEFIO_PORT_A_USED_COUNT BITCOUNT(DEFIO_PORT_A_USED_MASK)
#else
# define DEFIO_PORT_A_USED_MASK 0
# define DEFIO_PORT_A_USED_COUNT 0
#endif
#define DEFIO_PORT_A_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)

#if defined(TARGET_IO_PORTB)
# define DEFIO_PORT_B_USED_MASK TARGET_IO_PORTB
# define DEFIO_PORT_B_USED_COUNT BITCOUNT(DEFIO_PORT_B_USED_MASK)
#else
# define DEFIO_PORT_B_USED_MASK 0
# define DEFIO_PORT_B_USED_COUNT 0
#endif
#define DEFIO_PORT_B_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)

