ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
#if defined(TARGET_IO_PORTC)
# define DEFIO_PORT_C_USED_MASK TARGET_IO_PORTC
# define DEFIO_PORT_C_USED_COUNT BITCOUNT(DEFIO_PORT_C_USED_MASK)
#else
# define DEFIO_PORT_C_USED_MASK 0
# define DEFIO_PORT_C_USED_COUNT 0
#endif
#define DEFIO_PORT_C_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT)

#if defined(TARGET_IO_PORTD)
# define DEFIO_PORT_D_USED_MASK TARGET_IO_PORTD
# define DEFIO_PORT_D_USED_COUNT BITCOUNT(DEFIO_PORT_D_USED_MASK)
#else
# define DEFIO_PORT_D_USED_MASK 0
# define DEFIO_PORT_D_USED_COUNT 0
#endif
#define DEFIO_PORT_D_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT)

#if defined(TARGET_IO_PORTE)
# define DEFIO_PORT_E_USED_MASK TARGET_IO_PORTE
# define DEFIO_PORT_E_USED_COUNT BITCOUNT(DEFIO_PORT_E_USED_MASK)
#else
# define DEFIO_PORT_E_USED_MASK 0
# define DEFIO_PORT_E_USED_COUNT 0
#endif
#define DEFIO_PORT_E_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT)

#if defined(TARGET_IO_PORTF)
# define DEFIO_PORT_F_USED_MASK TARGET_IO_PORTF
# define DEFIO_PORT_F_USED_COUNT BITCOUNT(DEFIO_PORT_F_USED_MASK)
#else
# define DEFIO_PORT_F_USED_MASK 0
# define DEFIO_PORT_F_USED_COUNT 0
#endif
#define DEFIO_PORT_F_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#if defined(TARGET_IO_PORTG)
# define DEFIO_PORT_G_USED_MASK TARGET_IO_PORTG
# define DEFIO_PORT_G_USED_COUNT BITCOUNT(DEFIO_PORT_G_USED_MASK)
#else
# define DEFIO_PORT_G_USED_MASK 0
# define DEFIO_PORT_G_USED_COUNT 0
#endif
#define DEFIO_PORT_G_OFFSET (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)



// DEFIO_GPIOID__<port> maps to port index
#define DEFIO_GPIOID__0 0
#define DEFIO_GPIOID__1 1
#define DEFIO_GPIOID__2 2
#define DEFIO_GPIOID__3 3
#define DEFIO_GPIOID__4 4
#define DEFIO_GPIOID__5 5
#define DEFIO_GPIOID__6 6
#define DEFIO_GPIOID__7 7
#define DEFIO_GPIOID__8 8
#define DEFIO_GPIOID__9 9
#define DEFIO_GPIOID__14 10
#define DEFIO_GPIOID__15 11
#define DEFIO_GPIOID__A 12
#define DEFIO_GPIOID__B 13
#define DEFIO_GPIOID__C 14
#define DEFIO_GPIOID__D 15
#define DEFIO_GPIOID__E 16
#define DEFIO_GPIOID__F 17
#define DEFIO_GPIOID__G 18

// DEFIO_TAG__P<port><pin> will expand to TAG if defined for target, error is triggered otherwise
// DEFIO_TAG_E__P<port><pin> will expand to TAG if defined, to NONE otherwise (usefull for tables that are CPU-specific)
// DEFIO_REC__P<port><pin> will expand to ioRec* (using DEFIO_REC_INDEX(idx))

#if DEFIO_PORT_0_USED_MASK & BIT(0)
# define DEFIO_TAG__P00 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 0)
# define DEFIO_TAG_E__P00 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 0)
# define DEFIO_REC__P00 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(0) - 1)) + 0)
#else
# define DEFIO_TAG__P00 defio_error_P00_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P00 DEFIO_TAG_E__NONE
# define DEFIO_REC__P00 defio_error_P00_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(1)
# define DEFIO_TAG__P01 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 1)
# define DEFIO_TAG_E__P01 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 1)
# define DEFIO_REC__P01 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(1) - 1)) + 0)
#else
# define DEFIO_TAG__P01 defio_error_P01_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P01 DEFIO_TAG_E__NONE
# define DEFIO_REC__P01 defio_error_P01_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(2)
# define DEFIO_TAG__P02 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 2)
# define DEFIO_TAG_E__P02 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 2)
# define DEFIO_REC__P02 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(2) - 1)) + 0)
#else
# define DEFIO_TAG__P02 defio_error_P02_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P02 DEFIO_TAG_E__NONE
# define DEFIO_REC__P02 defio_error_P02_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(3)
# define DEFIO_TAG__P03 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 3)
# define DEFIO_TAG_E__P03 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 3)
# define DEFIO_REC__P03 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(3) - 1)) + 0)
#else
# define DEFIO_TAG__P03 defio_error_P03_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P03 DEFIO_TAG_E__NONE
# define DEFIO_REC__P03 defio_error_P03_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(4)
# define DEFIO_TAG__P04 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 4)
# define DEFIO_TAG_E__P04 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 4)
# define DEFIO_REC__P04 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(4) - 1)) + 0)
#else
# define DEFIO_TAG__P04 defio_error_P04_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P04 DEFIO_TAG_E__NONE
# define DEFIO_REC__P04 defio_error_P04_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(5)
# define DEFIO_TAG__P05 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 5)
# define DEFIO_TAG_E__P05 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 5)
# define DEFIO_REC__P05 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(5) - 1)) + 0)
#else
# define DEFIO_TAG__P05 defio_error_P05_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P05 DEFIO_TAG_E__NONE
# define DEFIO_REC__P05 defio_error_P05_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(6)
# define DEFIO_TAG__P06 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 6)
# define DEFIO_TAG_E__P06 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 6)
# define DEFIO_REC__P06 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(6) - 1)) + 0)
#else
# define DEFIO_TAG__P06 defio_error_P06_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P06 DEFIO_TAG_E__NONE
# define DEFIO_REC__P06 defio_error_P06_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(7)
# define DEFIO_TAG__P07 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 7)
# define DEFIO_TAG_E__P07 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 7)
# define DEFIO_REC__P07 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(7) - 1)) + 0)
#else
# define DEFIO_TAG__P07 defio_error_P07_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P07 DEFIO_TAG_E__NONE
# define DEFIO_REC__P07 defio_error_P07_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(8)
# define DEFIO_TAG__P08 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 8)
# define DEFIO_TAG_E__P08 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 8)
# define DEFIO_REC__P08 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(8) - 1)) + 0)
#else
# define DEFIO_TAG__P08 defio_error_P08_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P08 DEFIO_TAG_E__NONE
# define DEFIO_REC__P08 defio_error_P08_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(9)
# define DEFIO_TAG__P09 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 9)
# define DEFIO_TAG_E__P09 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 9)
# define DEFIO_REC__P09 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(9) - 1)) + 0)
#else
# define DEFIO_TAG__P09 defio_error_P09_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P09 DEFIO_TAG_E__NONE
# define DEFIO_REC__P09 defio_error_P09_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(10)
# define DEFIO_TAG__P010 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 10)
# define DEFIO_TAG_E__P010 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 10)
# define DEFIO_REC__P010 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(10) - 1)) + 0)
#else
# define DEFIO_TAG__P010 defio_error_P010_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P010 DEFIO_TAG_E__NONE
# define DEFIO_REC__P010 defio_error_P010_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(11)
# define DEFIO_TAG__P011 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 11)
# define DEFIO_TAG_E__P011 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 11)
# define DEFIO_REC__P011 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(11) - 1)) + 0)
#else
# define DEFIO_TAG__P011 defio_error_P011_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P011 DEFIO_TAG_E__NONE
# define DEFIO_REC__P011 defio_error_P011_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(12)
# define DEFIO_TAG__P012 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 12)
# define DEFIO_TAG_E__P012 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 12)
# define DEFIO_REC__P012 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(12) - 1)) + 0)
#else
# define DEFIO_TAG__P012 defio_error_P012_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P012 DEFIO_TAG_E__NONE
# define DEFIO_REC__P012 defio_error_P012_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(13)
# define DEFIO_TAG__P013 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 13)
# define DEFIO_TAG_E__P013 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 13)
# define DEFIO_REC__P013 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(13) - 1)) + 0)
#else
# define DEFIO_TAG__P013 defio_error_P013_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P013 DEFIO_TAG_E__NONE
# define DEFIO_REC__P013 defio_error_P013_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(14)
# define DEFIO_TAG__P014 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 14)
# define DEFIO_TAG_E__P014 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 14)
# define DEFIO_REC__P014 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(14) - 1)) + 0)
#else
# define DEFIO_TAG__P014 defio_error_P014_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P014 DEFIO_TAG_E__NONE
# define DEFIO_REC__P014 defio_error_P014_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_0_USED_MASK & BIT(15)
# define DEFIO_TAG__P015 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 15)
# define DEFIO_TAG_E__P015 DEFIO_TAG_MAKE(DEFIO_GPIOID__0, 15)
# define DEFIO_REC__P015 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_0_USED_MASK & (BIT(15) - 1)) + 0)
#else
# define DEFIO_TAG__P015 defio_error_P015_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P015 DEFIO_TAG_E__NONE
# define DEFIO_REC__P015 defio_error_P015_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(0)
# define DEFIO_TAG__P10 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 0)
# define DEFIO_TAG_E__P10 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 0)
# define DEFIO_REC__P10 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P10 defio_error_P10_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P10 DEFIO_TAG_E__NONE
# define DEFIO_REC__P10 defio_error_P10_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(1)
# define DEFIO_TAG__P11 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 1)
# define DEFIO_TAG_E__P11 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 1)
# define DEFIO_REC__P11 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P11 defio_error_P11_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P11 DEFIO_TAG_E__NONE
# define DEFIO_REC__P11 defio_error_P11_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(2)
# define DEFIO_TAG__P12 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 2)
# define DEFIO_TAG_E__P12 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 2)
# define DEFIO_REC__P12 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P12 defio_error_P12_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P12 DEFIO_TAG_E__NONE
# define DEFIO_REC__P12 defio_error_P12_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(3)
# define DEFIO_TAG__P13 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 3)
# define DEFIO_TAG_E__P13 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 3)
# define DEFIO_REC__P13 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P13 defio_error_P13_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P13 DEFIO_TAG_E__NONE
# define DEFIO_REC__P13 defio_error_P13_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(4)
# define DEFIO_TAG__P14 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 4)
# define DEFIO_TAG_E__P14 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 4)
# define DEFIO_REC__P14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P14 defio_error_P14_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P14 DEFIO_TAG_E__NONE
# define DEFIO_REC__P14 defio_error_P14_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(5)
# define DEFIO_TAG__P15 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 5)
# define DEFIO_TAG_E__P15 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 5)
# define DEFIO_REC__P15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P15 defio_error_P15_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P15 DEFIO_TAG_E__NONE
# define DEFIO_REC__P15 defio_error_P15_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(6)
# define DEFIO_TAG__P16 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 6)
# define DEFIO_TAG_E__P16 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 6)
# define DEFIO_REC__P16 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P16 defio_error_P16_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P16 DEFIO_TAG_E__NONE
# define DEFIO_REC__P16 defio_error_P16_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(7)
# define DEFIO_TAG__P17 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 7)
# define DEFIO_TAG_E__P17 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 7)
# define DEFIO_REC__P17 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P17 defio_error_P17_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P17 DEFIO_TAG_E__NONE
# define DEFIO_REC__P17 defio_error_P17_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(8)
# define DEFIO_TAG__P18 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 8)
# define DEFIO_TAG_E__P18 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 8)
# define DEFIO_REC__P18 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P18 defio_error_P18_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P18 DEFIO_TAG_E__NONE
# define DEFIO_REC__P18 defio_error_P18_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(9)
# define DEFIO_TAG__P19 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 9)
# define DEFIO_TAG_E__P19 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 9)
# define DEFIO_REC__P19 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P19 defio_error_P19_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P19 DEFIO_TAG_E__NONE
# define DEFIO_REC__P19 defio_error_P19_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(10)
# define DEFIO_TAG__P110 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 10)
# define DEFIO_TAG_E__P110 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 10)
# define DEFIO_REC__P110 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P110 defio_error_P110_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P110 DEFIO_TAG_E__NONE
# define DEFIO_REC__P110 defio_error_P110_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(11)
# define DEFIO_TAG__P111 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 11)
# define DEFIO_TAG_E__P111 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 11)
# define DEFIO_REC__P111 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P111 defio_error_P111_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P111 DEFIO_TAG_E__NONE
# define DEFIO_REC__P111 defio_error_P111_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(12)
# define DEFIO_TAG__P112 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 12)
# define DEFIO_TAG_E__P112 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 12)
# define DEFIO_REC__P112 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P112 defio_error_P112_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P112 DEFIO_TAG_E__NONE
# define DEFIO_REC__P112 defio_error_P112_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(13)
# define DEFIO_TAG__P113 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 13)
# define DEFIO_TAG_E__P113 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 13)
# define DEFIO_REC__P113 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P113 defio_error_P113_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P113 DEFIO_TAG_E__NONE
# define DEFIO_REC__P113 defio_error_P113_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(14)
# define DEFIO_TAG__P114 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 14)
# define DEFIO_TAG_E__P114 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 14)
# define DEFIO_REC__P114 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P114 defio_error_P114_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P114 DEFIO_TAG_E__NONE
# define DEFIO_REC__P114 defio_error_P114_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_1_USED_MASK & BIT(15)
# define DEFIO_TAG__P115 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 15)
# define DEFIO_TAG_E__P115 DEFIO_TAG_MAKE(DEFIO_GPIOID__1, 15)
# define DEFIO_REC__P115 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_1_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT)
#else
# define DEFIO_TAG__P115 defio_error_P115_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P115 DEFIO_TAG_E__NONE
# define DEFIO_REC__P115 defio_error_P115_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(0)
# define DEFIO_TAG__P20 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 0)
# define DEFIO_TAG_E__P20 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 0)
# define DEFIO_REC__P20 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P20 defio_error_P20_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P20 DEFIO_TAG_E__NONE
# define DEFIO_REC__P20 defio_error_P20_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(1)
# define DEFIO_TAG__P21 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 1)
# define DEFIO_TAG_E__P21 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 1)
# define DEFIO_REC__P21 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P21 defio_error_P21_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P21 DEFIO_TAG_E__NONE
# define DEFIO_REC__P21 defio_error_P21_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(2)
# define DEFIO_TAG__P22 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 2)
# define DEFIO_TAG_E__P22 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 2)
# define DEFIO_REC__P22 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P22 defio_error_P22_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P22 DEFIO_TAG_E__NONE
# define DEFIO_REC__P22 defio_error_P22_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(3)
# define DEFIO_TAG__P23 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 3)
# define DEFIO_TAG_E__P23 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 3)
# define DEFIO_REC__P23 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P23 defio_error_P23_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P23 DEFIO_TAG_E__NONE
# define DEFIO_REC__P23 defio_error_P23_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(4)
# define DEFIO_TAG__P24 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 4)
# define DEFIO_TAG_E__P24 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 4)
# define DEFIO_REC__P24 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P24 defio_error_P24_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P24 DEFIO_TAG_E__NONE
# define DEFIO_REC__P24 defio_error_P24_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(5)
# define DEFIO_TAG__P25 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 5)
# define DEFIO_TAG_E__P25 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 5)
# define DEFIO_REC__P25 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P25 defio_error_P25_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P25 DEFIO_TAG_E__NONE
# define DEFIO_REC__P25 defio_error_P25_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(6)
# define DEFIO_TAG__P26 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 6)
# define DEFIO_TAG_E__P26 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 6)
# define DEFIO_REC__P26 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P26 defio_error_P26_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P26 DEFIO_TAG_E__NONE
# define DEFIO_REC__P26 defio_error_P26_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(7)
# define DEFIO_TAG__P27 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 7)
# define DEFIO_TAG_E__P27 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 7)
# define DEFIO_REC__P27 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P27 defio_error_P27_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P27 DEFIO_TAG_E__NONE
# define DEFIO_REC__P27 defio_error_P27_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(8)
# define DEFIO_TAG__P28 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 8)
# define DEFIO_TAG_E__P28 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 8)
# define DEFIO_REC__P28 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P28 defio_error_P28_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P28 DEFIO_TAG_E__NONE
# define DEFIO_REC__P28 defio_error_P28_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(9)
# define DEFIO_TAG__P29 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 9)
# define DEFIO_TAG_E__P29 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 9)
# define DEFIO_REC__P29 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P29 defio_error_P29_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P29 DEFIO_TAG_E__NONE
# define DEFIO_REC__P29 defio_error_P29_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(10)
# define DEFIO_TAG__P210 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 10)
# define DEFIO_TAG_E__P210 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 10)
# define DEFIO_REC__P210 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P210 defio_error_P210_is_not_supported_on_TARGET
