ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
# define DEFIO_TAG_E__P210 DEFIO_TAG_E__NONE
# define DEFIO_REC__P210 defio_error_P210_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(11)
# define DEFIO_TAG__P211 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 11)
# define DEFIO_TAG_E__P211 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 11)
# define DEFIO_REC__P211 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P211 defio_error_P211_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P211 DEFIO_TAG_E__NONE
# define DEFIO_REC__P211 defio_error_P211_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(12)
# define DEFIO_TAG__P212 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 12)
# define DEFIO_TAG_E__P212 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 12)
# define DEFIO_REC__P212 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P212 defio_error_P212_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P212 DEFIO_TAG_E__NONE
# define DEFIO_REC__P212 defio_error_P212_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(13)
# define DEFIO_TAG__P213 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 13)
# define DEFIO_TAG_E__P213 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 13)
# define DEFIO_REC__P213 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P213 defio_error_P213_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P213 DEFIO_TAG_E__NONE
# define DEFIO_REC__P213 defio_error_P213_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(14)
# define DEFIO_TAG__P214 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 14)
# define DEFIO_TAG_E__P214 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 14)
# define DEFIO_REC__P214 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P214 defio_error_P214_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P214 DEFIO_TAG_E__NONE
# define DEFIO_REC__P214 defio_error_P214_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_2_USED_MASK & BIT(15)
# define DEFIO_TAG__P215 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 15)
# define DEFIO_TAG_E__P215 DEFIO_TAG_MAKE(DEFIO_GPIOID__2, 15)
# define DEFIO_REC__P215 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_2_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT)
#else
# define DEFIO_TAG__P215 defio_error_P215_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P215 DEFIO_TAG_E__NONE
# define DEFIO_REC__P215 defio_error_P215_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(0)
# define DEFIO_TAG__P30 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 0)
# define DEFIO_TAG_E__P30 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 0)
# define DEFIO_REC__P30 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P30 defio_error_P30_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P30 DEFIO_TAG_E__NONE
# define DEFIO_REC__P30 defio_error_P30_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(1)
# define DEFIO_TAG__P31 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 1)
# define DEFIO_TAG_E__P31 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 1)
# define DEFIO_REC__P31 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P31 defio_error_P31_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P31 DEFIO_TAG_E__NONE
# define DEFIO_REC__P31 defio_error_P31_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(2)
# define DEFIO_TAG__P32 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 2)
# define DEFIO_TAG_E__P32 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 2)
# define DEFIO_REC__P32 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P32 defio_error_P32_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P32 DEFIO_TAG_E__NONE
# define DEFIO_REC__P32 defio_error_P32_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(3)
# define DEFIO_TAG__P33 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 3)
# define DEFIO_TAG_E__P33 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 3)
# define DEFIO_REC__P33 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P33 defio_error_P33_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P33 DEFIO_TAG_E__NONE
# define DEFIO_REC__P33 defio_error_P33_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(4)
# define DEFIO_TAG__P34 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 4)
# define DEFIO_TAG_E__P34 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 4)
# define DEFIO_REC__P34 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P34 defio_error_P34_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P34 DEFIO_TAG_E__NONE
# define DEFIO_REC__P34 defio_error_P34_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(5)
# define DEFIO_TAG__P35 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 5)
# define DEFIO_TAG_E__P35 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 5)
# define DEFIO_REC__P35 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P35 defio_error_P35_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P35 DEFIO_TAG_E__NONE
# define DEFIO_REC__P35 defio_error_P35_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(6)
# define DEFIO_TAG__P36 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 6)
# define DEFIO_TAG_E__P36 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 6)
# define DEFIO_REC__P36 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P36 defio_error_P36_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P36 DEFIO_TAG_E__NONE
# define DEFIO_REC__P36 defio_error_P36_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(7)
# define DEFIO_TAG__P37 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 7)
# define DEFIO_TAG_E__P37 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 7)
# define DEFIO_REC__P37 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P37 defio_error_P37_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P37 DEFIO_TAG_E__NONE
# define DEFIO_REC__P37 defio_error_P37_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(8)
# define DEFIO_TAG__P38 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 8)
# define DEFIO_TAG_E__P38 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 8)
# define DEFIO_REC__P38 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P38 defio_error_P38_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P38 DEFIO_TAG_E__NONE
# define DEFIO_REC__P38 defio_error_P38_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(9)
# define DEFIO_TAG__P39 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 9)
# define DEFIO_TAG_E__P39 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 9)
# define DEFIO_REC__P39 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P39 defio_error_P39_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P39 DEFIO_TAG_E__NONE
# define DEFIO_REC__P39 defio_error_P39_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(10)
# define DEFIO_TAG__P310 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 10)
# define DEFIO_TAG_E__P310 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 10)
# define DEFIO_REC__P310 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P310 defio_error_P310_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P310 DEFIO_TAG_E__NONE
# define DEFIO_REC__P310 defio_error_P310_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(11)
# define DEFIO_TAG__P311 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 11)
# define DEFIO_TAG_E__P311 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 11)
# define DEFIO_REC__P311 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P311 defio_error_P311_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P311 DEFIO_TAG_E__NONE
# define DEFIO_REC__P311 defio_error_P311_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(12)
# define DEFIO_TAG__P312 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 12)
# define DEFIO_TAG_E__P312 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 12)
# define DEFIO_REC__P312 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P312 defio_error_P312_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P312 DEFIO_TAG_E__NONE
# define DEFIO_REC__P312 defio_error_P312_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(13)
# define DEFIO_TAG__P313 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 13)
# define DEFIO_TAG_E__P313 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 13)
# define DEFIO_REC__P313 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P313 defio_error_P313_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P313 DEFIO_TAG_E__NONE
# define DEFIO_REC__P313 defio_error_P313_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(14)
# define DEFIO_TAG__P314 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 14)
# define DEFIO_TAG_E__P314 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 14)
# define DEFIO_REC__P314 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P314 defio_error_P314_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P314 DEFIO_TAG_E__NONE
# define DEFIO_REC__P314 defio_error_P314_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_3_USED_MASK & BIT(15)
# define DEFIO_TAG__P315 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 15)
# define DEFIO_TAG_E__P315 DEFIO_TAG_MAKE(DEFIO_GPIOID__3, 15)
# define DEFIO_REC__P315 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_3_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT)
#else
# define DEFIO_TAG__P315 defio_error_P315_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P315 DEFIO_TAG_E__NONE
# define DEFIO_REC__P315 defio_error_P315_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(0)
# define DEFIO_TAG__P40 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 0)
# define DEFIO_TAG_E__P40 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 0)
# define DEFIO_REC__P40 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P40 defio_error_P40_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P40 DEFIO_TAG_E__NONE
# define DEFIO_REC__P40 defio_error_P40_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(1)
# define DEFIO_TAG__P41 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 1)
# define DEFIO_TAG_E__P41 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 1)
# define DEFIO_REC__P41 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P41 defio_error_P41_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P41 DEFIO_TAG_E__NONE
# define DEFIO_REC__P41 defio_error_P41_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(2)
# define DEFIO_TAG__P42 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 2)
# define DEFIO_TAG_E__P42 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 2)
# define DEFIO_REC__P42 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P42 defio_error_P42_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P42 DEFIO_TAG_E__NONE
# define DEFIO_REC__P42 defio_error_P42_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(3)
# define DEFIO_TAG__P43 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 3)
# define DEFIO_TAG_E__P43 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 3)
# define DEFIO_REC__P43 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P43 defio_error_P43_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P43 DEFIO_TAG_E__NONE
# define DEFIO_REC__P43 defio_error_P43_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(4)
# define DEFIO_TAG__P44 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 4)
# define DEFIO_TAG_E__P44 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 4)
# define DEFIO_REC__P44 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P44 defio_error_P44_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P44 DEFIO_TAG_E__NONE
# define DEFIO_REC__P44 defio_error_P44_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(5)
# define DEFIO_TAG__P45 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 5)
# define DEFIO_TAG_E__P45 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 5)
# define DEFIO_REC__P45 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P45 defio_error_P45_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P45 DEFIO_TAG_E__NONE
# define DEFIO_REC__P45 defio_error_P45_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(6)
# define DEFIO_TAG__P46 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 6)
# define DEFIO_TAG_E__P46 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 6)
# define DEFIO_REC__P46 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P46 defio_error_P46_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P46 DEFIO_TAG_E__NONE
# define DEFIO_REC__P46 defio_error_P46_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(7)
# define DEFIO_TAG__P47 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 7)
# define DEFIO_TAG_E__P47 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 7)
# define DEFIO_REC__P47 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P47 defio_error_P47_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P47 DEFIO_TAG_E__NONE
# define DEFIO_REC__P47 defio_error_P47_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(8)
# define DEFIO_TAG__P48 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 8)
# define DEFIO_TAG_E__P48 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 8)
# define DEFIO_REC__P48 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P48 defio_error_P48_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P48 DEFIO_TAG_E__NONE
# define DEFIO_REC__P48 defio_error_P48_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(9)
# define DEFIO_TAG__P49 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 9)
# define DEFIO_TAG_E__P49 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 9)
# define DEFIO_REC__P49 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P49 defio_error_P49_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P49 DEFIO_TAG_E__NONE
# define DEFIO_REC__P49 defio_error_P49_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(10)
# define DEFIO_TAG__P410 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 10)
# define DEFIO_TAG_E__P410 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 10)
# define DEFIO_REC__P410 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P410 defio_error_P410_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P410 DEFIO_TAG_E__NONE
# define DEFIO_REC__P410 defio_error_P410_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(11)
# define DEFIO_TAG__P411 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 11)
# define DEFIO_TAG_E__P411 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 11)
# define DEFIO_REC__P411 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P411 defio_error_P411_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P411 DEFIO_TAG_E__NONE
# define DEFIO_REC__P411 defio_error_P411_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(12)
# define DEFIO_TAG__P412 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 12)
# define DEFIO_TAG_E__P412 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 12)
# define DEFIO_REC__P412 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P412 defio_error_P412_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P412 DEFIO_TAG_E__NONE
# define DEFIO_REC__P412 defio_error_P412_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(13)
# define DEFIO_TAG__P413 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 13)
# define DEFIO_TAG_E__P413 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 13)
# define DEFIO_REC__P413 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P413 defio_error_P413_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P413 DEFIO_TAG_E__NONE
# define DEFIO_REC__P413 defio_error_P413_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(14)
# define DEFIO_TAG__P414 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 14)
# define DEFIO_TAG_E__P414 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 14)
# define DEFIO_REC__P414 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P414 defio_error_P414_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P414 DEFIO_TAG_E__NONE
# define DEFIO_REC__P414 defio_error_P414_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_4_USED_MASK & BIT(15)
# define DEFIO_TAG__P415 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 15)
# define DEFIO_TAG_E__P415 DEFIO_TAG_MAKE(DEFIO_GPIOID__4, 15)
# define DEFIO_REC__P415 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_4_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT)
#else
# define DEFIO_TAG__P415 defio_error_P415_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P415 DEFIO_TAG_E__NONE
# define DEFIO_REC__P415 defio_error_P415_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(0)
# define DEFIO_TAG__P50 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 0)
# define DEFIO_TAG_E__P50 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 0)
# define DEFIO_REC__P50 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P50 defio_error_P50_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P50 DEFIO_TAG_E__NONE
# define DEFIO_REC__P50 defio_error_P50_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(1)
# define DEFIO_TAG__P51 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 1)
# define DEFIO_TAG_E__P51 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 1)
# define DEFIO_REC__P51 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P51 defio_error_P51_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P51 DEFIO_TAG_E__NONE
# define DEFIO_REC__P51 defio_error_P51_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(2)
# define DEFIO_TAG__P52 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 2)
# define DEFIO_TAG_E__P52 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 2)
# define DEFIO_REC__P52 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P52 defio_error_P52_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P52 DEFIO_TAG_E__NONE
# define DEFIO_REC__P52 defio_error_P52_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(3)
# define DEFIO_TAG__P53 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 3)
# define DEFIO_TAG_E__P53 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 3)
# define DEFIO_REC__P53 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P53 defio_error_P53_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P53 DEFIO_TAG_E__NONE
# define DEFIO_REC__P53 defio_error_P53_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(4)
# define DEFIO_TAG__P54 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 4)
# define DEFIO_TAG_E__P54 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 4)
# define DEFIO_REC__P54 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P54 defio_error_P54_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P54 DEFIO_TAG_E__NONE
# define DEFIO_REC__P54 defio_error_P54_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(5)
# define DEFIO_TAG__P55 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 5)
# define DEFIO_TAG_E__P55 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 5)
# define DEFIO_REC__P55 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P55 defio_error_P55_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P55 DEFIO_TAG_E__NONE
# define DEFIO_REC__P55 defio_error_P55_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(6)
# define DEFIO_TAG__P56 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 6)
# define DEFIO_TAG_E__P56 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 6)
# define DEFIO_REC__P56 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P56 defio_error_P56_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P56 DEFIO_TAG_E__NONE
# define DEFIO_REC__P56 defio_error_P56_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(7)
# define DEFIO_TAG__P57 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 7)
# define DEFIO_TAG_E__P57 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 7)
# define DEFIO_REC__P57 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P57 defio_error_P57_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P57 DEFIO_TAG_E__NONE
