ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
# define DEFIO_REC__P57 defio_error_P57_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(8)
# define DEFIO_TAG__P58 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 8)
# define DEFIO_TAG_E__P58 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 8)
# define DEFIO_REC__P58 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P58 defio_error_P58_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P58 DEFIO_TAG_E__NONE
# define DEFIO_REC__P58 defio_error_P58_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(9)
# define DEFIO_TAG__P59 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 9)
# define DEFIO_TAG_E__P59 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 9)
# define DEFIO_REC__P59 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P59 defio_error_P59_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P59 DEFIO_TAG_E__NONE
# define DEFIO_REC__P59 defio_error_P59_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(10)
# define DEFIO_TAG__P510 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 10)
# define DEFIO_TAG_E__P510 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 10)
# define DEFIO_REC__P510 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P510 defio_error_P510_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P510 DEFIO_TAG_E__NONE
# define DEFIO_REC__P510 defio_error_P510_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(11)
# define DEFIO_TAG__P511 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 11)
# define DEFIO_TAG_E__P511 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 11)
# define DEFIO_REC__P511 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P511 defio_error_P511_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P511 DEFIO_TAG_E__NONE
# define DEFIO_REC__P511 defio_error_P511_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(12)
# define DEFIO_TAG__P512 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 12)
# define DEFIO_TAG_E__P512 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 12)
# define DEFIO_REC__P512 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P512 defio_error_P512_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P512 DEFIO_TAG_E__NONE
# define DEFIO_REC__P512 defio_error_P512_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(13)
# define DEFIO_TAG__P513 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 13)
# define DEFIO_TAG_E__P513 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 13)
# define DEFIO_REC__P513 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P513 defio_error_P513_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P513 DEFIO_TAG_E__NONE
# define DEFIO_REC__P513 defio_error_P513_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(14)
# define DEFIO_TAG__P514 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 14)
# define DEFIO_TAG_E__P514 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 14)
# define DEFIO_REC__P514 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P514 defio_error_P514_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P514 DEFIO_TAG_E__NONE
# define DEFIO_REC__P514 defio_error_P514_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_5_USED_MASK & BIT(15)
# define DEFIO_TAG__P515 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 15)
# define DEFIO_TAG_E__P515 DEFIO_TAG_MAKE(DEFIO_GPIOID__5, 15)
# define DEFIO_REC__P515 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_5_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT)
#else
# define DEFIO_TAG__P515 defio_error_P515_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P515 DEFIO_TAG_E__NONE
# define DEFIO_REC__P515 defio_error_P515_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(0)
# define DEFIO_TAG__P60 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 0)
# define DEFIO_TAG_E__P60 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 0)
# define DEFIO_REC__P60 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P60 defio_error_P60_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P60 DEFIO_TAG_E__NONE
# define DEFIO_REC__P60 defio_error_P60_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(1)
# define DEFIO_TAG__P61 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 1)
# define DEFIO_TAG_E__P61 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 1)
# define DEFIO_REC__P61 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P61 defio_error_P61_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P61 DEFIO_TAG_E__NONE
# define DEFIO_REC__P61 defio_error_P61_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(2)
# define DEFIO_TAG__P62 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 2)
# define DEFIO_TAG_E__P62 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 2)
# define DEFIO_REC__P62 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P62 defio_error_P62_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P62 DEFIO_TAG_E__NONE
# define DEFIO_REC__P62 defio_error_P62_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(3)
# define DEFIO_TAG__P63 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 3)
# define DEFIO_TAG_E__P63 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 3)
# define DEFIO_REC__P63 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P63 defio_error_P63_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P63 DEFIO_TAG_E__NONE
# define DEFIO_REC__P63 defio_error_P63_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(4)
# define DEFIO_TAG__P64 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 4)
# define DEFIO_TAG_E__P64 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 4)
# define DEFIO_REC__P64 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P64 defio_error_P64_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P64 DEFIO_TAG_E__NONE
# define DEFIO_REC__P64 defio_error_P64_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(5)
# define DEFIO_TAG__P65 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 5)
# define DEFIO_TAG_E__P65 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 5)
# define DEFIO_REC__P65 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P65 defio_error_P65_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P65 DEFIO_TAG_E__NONE
# define DEFIO_REC__P65 defio_error_P65_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(6)
# define DEFIO_TAG__P66 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 6)
# define DEFIO_TAG_E__P66 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 6)
# define DEFIO_REC__P66 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P66 defio_error_P66_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P66 DEFIO_TAG_E__NONE
# define DEFIO_REC__P66 defio_error_P66_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(7)
# define DEFIO_TAG__P67 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 7)
# define DEFIO_TAG_E__P67 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 7)
# define DEFIO_REC__P67 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P67 defio_error_P67_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P67 DEFIO_TAG_E__NONE
# define DEFIO_REC__P67 defio_error_P67_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(8)
# define DEFIO_TAG__P68 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 8)
# define DEFIO_TAG_E__P68 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 8)
# define DEFIO_REC__P68 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P68 defio_error_P68_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P68 DEFIO_TAG_E__NONE
# define DEFIO_REC__P68 defio_error_P68_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(9)
# define DEFIO_TAG__P69 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 9)
# define DEFIO_TAG_E__P69 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 9)
# define DEFIO_REC__P69 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P69 defio_error_P69_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P69 DEFIO_TAG_E__NONE
# define DEFIO_REC__P69 defio_error_P69_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(10)
# define DEFIO_TAG__P610 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 10)
# define DEFIO_TAG_E__P610 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 10)
# define DEFIO_REC__P610 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P610 defio_error_P610_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P610 DEFIO_TAG_E__NONE
# define DEFIO_REC__P610 defio_error_P610_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(11)
# define DEFIO_TAG__P611 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 11)
# define DEFIO_TAG_E__P611 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 11)
# define DEFIO_REC__P611 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P611 defio_error_P611_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P611 DEFIO_TAG_E__NONE
# define DEFIO_REC__P611 defio_error_P611_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(12)
# define DEFIO_TAG__P612 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 12)
# define DEFIO_TAG_E__P612 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 12)
# define DEFIO_REC__P612 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P612 defio_error_P612_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P612 DEFIO_TAG_E__NONE
# define DEFIO_REC__P612 defio_error_P612_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(13)
# define DEFIO_TAG__P613 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 13)
# define DEFIO_TAG_E__P613 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 13)
# define DEFIO_REC__P613 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P613 defio_error_P613_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P613 DEFIO_TAG_E__NONE
# define DEFIO_REC__P613 defio_error_P613_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(14)
# define DEFIO_TAG__P614 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 14)
# define DEFIO_TAG_E__P614 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 14)
# define DEFIO_REC__P614 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P614 defio_error_P614_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P614 DEFIO_TAG_E__NONE
# define DEFIO_REC__P614 defio_error_P614_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_6_USED_MASK & BIT(15)
# define DEFIO_TAG__P615 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 15)
# define DEFIO_TAG_E__P615 DEFIO_TAG_MAKE(DEFIO_GPIOID__6, 15)
# define DEFIO_REC__P615 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_6_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT)
#else
# define DEFIO_TAG__P615 defio_error_P615_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P615 DEFIO_TAG_E__NONE
# define DEFIO_REC__P615 defio_error_P615_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(0)
# define DEFIO_TAG__P70 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 0)
# define DEFIO_TAG_E__P70 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 0)
# define DEFIO_REC__P70 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P70 defio_error_P70_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P70 DEFIO_TAG_E__NONE
# define DEFIO_REC__P70 defio_error_P70_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(1)
# define DEFIO_TAG__P71 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 1)
# define DEFIO_TAG_E__P71 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 1)
# define DEFIO_REC__P71 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P71 defio_error_P71_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P71 DEFIO_TAG_E__NONE
# define DEFIO_REC__P71 defio_error_P71_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(2)
# define DEFIO_TAG__P72 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 2)
# define DEFIO_TAG_E__P72 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 2)
# define DEFIO_REC__P72 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P72 defio_error_P72_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P72 DEFIO_TAG_E__NONE
# define DEFIO_REC__P72 defio_error_P72_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(3)
# define DEFIO_TAG__P73 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 3)
# define DEFIO_TAG_E__P73 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 3)
# define DEFIO_REC__P73 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P73 defio_error_P73_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P73 DEFIO_TAG_E__NONE
# define DEFIO_REC__P73 defio_error_P73_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(4)
# define DEFIO_TAG__P74 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 4)
# define DEFIO_TAG_E__P74 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 4)
# define DEFIO_REC__P74 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P74 defio_error_P74_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P74 DEFIO_TAG_E__NONE
# define DEFIO_REC__P74 defio_error_P74_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(5)
# define DEFIO_TAG__P75 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 5)
# define DEFIO_TAG_E__P75 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 5)
# define DEFIO_REC__P75 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P75 defio_error_P75_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P75 DEFIO_TAG_E__NONE
# define DEFIO_REC__P75 defio_error_P75_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(6)
# define DEFIO_TAG__P76 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 6)
# define DEFIO_TAG_E__P76 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 6)
# define DEFIO_REC__P76 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P76 defio_error_P76_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P76 DEFIO_TAG_E__NONE
# define DEFIO_REC__P76 defio_error_P76_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(7)
# define DEFIO_TAG__P77 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 7)
# define DEFIO_TAG_E__P77 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 7)
# define DEFIO_REC__P77 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P77 defio_error_P77_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P77 DEFIO_TAG_E__NONE
# define DEFIO_REC__P77 defio_error_P77_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(8)
# define DEFIO_TAG__P78 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 8)
# define DEFIO_TAG_E__P78 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 8)
# define DEFIO_REC__P78 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P78 defio_error_P78_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P78 DEFIO_TAG_E__NONE
# define DEFIO_REC__P78 defio_error_P78_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(9)
# define DEFIO_TAG__P79 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 9)
# define DEFIO_TAG_E__P79 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 9)
# define DEFIO_REC__P79 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P79 defio_error_P79_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P79 DEFIO_TAG_E__NONE
# define DEFIO_REC__P79 defio_error_P79_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(10)
# define DEFIO_TAG__P710 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 10)
# define DEFIO_TAG_E__P710 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 10)
# define DEFIO_REC__P710 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P710 defio_error_P710_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P710 DEFIO_TAG_E__NONE
# define DEFIO_REC__P710 defio_error_P710_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(11)
# define DEFIO_TAG__P711 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 11)
# define DEFIO_TAG_E__P711 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 11)
# define DEFIO_REC__P711 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P711 defio_error_P711_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P711 DEFIO_TAG_E__NONE
# define DEFIO_REC__P711 defio_error_P711_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(12)
# define DEFIO_TAG__P712 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 12)
# define DEFIO_TAG_E__P712 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 12)
# define DEFIO_REC__P712 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P712 defio_error_P712_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P712 DEFIO_TAG_E__NONE
# define DEFIO_REC__P712 defio_error_P712_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(13)
# define DEFIO_TAG__P713 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 13)
# define DEFIO_TAG_E__P713 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 13)
# define DEFIO_REC__P713 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P713 defio_error_P713_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P713 DEFIO_TAG_E__NONE
# define DEFIO_REC__P713 defio_error_P713_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(14)
# define DEFIO_TAG__P714 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 14)
# define DEFIO_TAG_E__P714 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 14)
# define DEFIO_REC__P714 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P714 defio_error_P714_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P714 DEFIO_TAG_E__NONE
# define DEFIO_REC__P714 defio_error_P714_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_7_USED_MASK & BIT(15)
# define DEFIO_TAG__P715 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 15)
# define DEFIO_TAG_E__P715 DEFIO_TAG_MAKE(DEFIO_GPIOID__7, 15)
# define DEFIO_REC__P715 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_7_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT)
#else
# define DEFIO_TAG__P715 defio_error_P715_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P715 DEFIO_TAG_E__NONE
# define DEFIO_REC__P715 defio_error_P715_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(0)
# define DEFIO_TAG__P80 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 0)
# define DEFIO_TAG_E__P80 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 0)
