ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
# define DEFIO_REC__P80 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P80 defio_error_P80_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P80 DEFIO_TAG_E__NONE
# define DEFIO_REC__P80 defio_error_P80_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(1)
# define DEFIO_TAG__P81 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 1)
# define DEFIO_TAG_E__P81 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 1)
# define DEFIO_REC__P81 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P81 defio_error_P81_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P81 DEFIO_TAG_E__NONE
# define DEFIO_REC__P81 defio_error_P81_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(2)
# define DEFIO_TAG__P82 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 2)
# define DEFIO_TAG_E__P82 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 2)
# define DEFIO_REC__P82 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P82 defio_error_P82_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P82 DEFIO_TAG_E__NONE
# define DEFIO_REC__P82 defio_error_P82_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(3)
# define DEFIO_TAG__P83 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 3)
# define DEFIO_TAG_E__P83 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 3)
# define DEFIO_REC__P83 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P83 defio_error_P83_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P83 DEFIO_TAG_E__NONE
# define DEFIO_REC__P83 defio_error_P83_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(4)
# define DEFIO_TAG__P84 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 4)
# define DEFIO_TAG_E__P84 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 4)
# define DEFIO_REC__P84 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P84 defio_error_P84_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P84 DEFIO_TAG_E__NONE
# define DEFIO_REC__P84 defio_error_P84_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(5)
# define DEFIO_TAG__P85 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 5)
# define DEFIO_TAG_E__P85 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 5)
# define DEFIO_REC__P85 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P85 defio_error_P85_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P85 DEFIO_TAG_E__NONE
# define DEFIO_REC__P85 defio_error_P85_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(6)
# define DEFIO_TAG__P86 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 6)
# define DEFIO_TAG_E__P86 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 6)
# define DEFIO_REC__P86 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P86 defio_error_P86_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P86 DEFIO_TAG_E__NONE
# define DEFIO_REC__P86 defio_error_P86_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(7)
# define DEFIO_TAG__P87 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 7)
# define DEFIO_TAG_E__P87 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 7)
# define DEFIO_REC__P87 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P87 defio_error_P87_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P87 DEFIO_TAG_E__NONE
# define DEFIO_REC__P87 defio_error_P87_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(8)
# define DEFIO_TAG__P88 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 8)
# define DEFIO_TAG_E__P88 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 8)
# define DEFIO_REC__P88 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P88 defio_error_P88_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P88 DEFIO_TAG_E__NONE
# define DEFIO_REC__P88 defio_error_P88_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(9)
# define DEFIO_TAG__P89 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 9)
# define DEFIO_TAG_E__P89 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 9)
# define DEFIO_REC__P89 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P89 defio_error_P89_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P89 DEFIO_TAG_E__NONE
# define DEFIO_REC__P89 defio_error_P89_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(10)
# define DEFIO_TAG__P810 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 10)
# define DEFIO_TAG_E__P810 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 10)
# define DEFIO_REC__P810 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P810 defio_error_P810_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P810 DEFIO_TAG_E__NONE
# define DEFIO_REC__P810 defio_error_P810_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(11)
# define DEFIO_TAG__P811 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 11)
# define DEFIO_TAG_E__P811 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 11)
# define DEFIO_REC__P811 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P811 defio_error_P811_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P811 DEFIO_TAG_E__NONE
# define DEFIO_REC__P811 defio_error_P811_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(12)
# define DEFIO_TAG__P812 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 12)
# define DEFIO_TAG_E__P812 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 12)
# define DEFIO_REC__P812 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P812 defio_error_P812_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P812 DEFIO_TAG_E__NONE
# define DEFIO_REC__P812 defio_error_P812_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(13)
# define DEFIO_TAG__P813 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 13)
# define DEFIO_TAG_E__P813 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 13)
# define DEFIO_REC__P813 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P813 defio_error_P813_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P813 DEFIO_TAG_E__NONE
# define DEFIO_REC__P813 defio_error_P813_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(14)
# define DEFIO_TAG__P814 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 14)
# define DEFIO_TAG_E__P814 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 14)
# define DEFIO_REC__P814 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P814 defio_error_P814_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P814 DEFIO_TAG_E__NONE
# define DEFIO_REC__P814 defio_error_P814_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_8_USED_MASK & BIT(15)
# define DEFIO_TAG__P815 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 15)
# define DEFIO_TAG_E__P815 DEFIO_TAG_MAKE(DEFIO_GPIOID__8, 15)
# define DEFIO_REC__P815 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_8_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT)
#else
# define DEFIO_TAG__P815 defio_error_P815_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P815 DEFIO_TAG_E__NONE
# define DEFIO_REC__P815 defio_error_P815_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(0)
# define DEFIO_TAG__P90 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 0)
# define DEFIO_TAG_E__P90 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 0)
# define DEFIO_REC__P90 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P90 defio_error_P90_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P90 DEFIO_TAG_E__NONE
# define DEFIO_REC__P90 defio_error_P90_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(1)
# define DEFIO_TAG__P91 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 1)
# define DEFIO_TAG_E__P91 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 1)
# define DEFIO_REC__P91 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P91 defio_error_P91_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P91 DEFIO_TAG_E__NONE
# define DEFIO_REC__P91 defio_error_P91_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(2)
# define DEFIO_TAG__P92 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 2)
# define DEFIO_TAG_E__P92 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 2)
# define DEFIO_REC__P92 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P92 defio_error_P92_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P92 DEFIO_TAG_E__NONE
# define DEFIO_REC__P92 defio_error_P92_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(3)
# define DEFIO_TAG__P93 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 3)
# define DEFIO_TAG_E__P93 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 3)
# define DEFIO_REC__P93 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P93 defio_error_P93_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P93 DEFIO_TAG_E__NONE
# define DEFIO_REC__P93 defio_error_P93_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(4)
# define DEFIO_TAG__P94 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 4)
# define DEFIO_TAG_E__P94 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 4)
# define DEFIO_REC__P94 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P94 defio_error_P94_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P94 DEFIO_TAG_E__NONE
# define DEFIO_REC__P94 defio_error_P94_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(5)
# define DEFIO_TAG__P95 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 5)
# define DEFIO_TAG_E__P95 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 5)
# define DEFIO_REC__P95 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P95 defio_error_P95_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P95 DEFIO_TAG_E__NONE
# define DEFIO_REC__P95 defio_error_P95_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(6)
# define DEFIO_TAG__P96 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 6)
# define DEFIO_TAG_E__P96 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 6)
# define DEFIO_REC__P96 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P96 defio_error_P96_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P96 DEFIO_TAG_E__NONE
# define DEFIO_REC__P96 defio_error_P96_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(7)
# define DEFIO_TAG__P97 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 7)
# define DEFIO_TAG_E__P97 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 7)
# define DEFIO_REC__P97 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P97 defio_error_P97_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P97 DEFIO_TAG_E__NONE
# define DEFIO_REC__P97 defio_error_P97_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(8)
# define DEFIO_TAG__P98 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 8)
# define DEFIO_TAG_E__P98 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 8)
# define DEFIO_REC__P98 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P98 defio_error_P98_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P98 DEFIO_TAG_E__NONE
# define DEFIO_REC__P98 defio_error_P98_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(9)
# define DEFIO_TAG__P99 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 9)
# define DEFIO_TAG_E__P99 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 9)
# define DEFIO_REC__P99 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P99 defio_error_P99_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P99 DEFIO_TAG_E__NONE
# define DEFIO_REC__P99 defio_error_P99_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(10)
# define DEFIO_TAG__P910 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 10)
# define DEFIO_TAG_E__P910 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 10)
# define DEFIO_REC__P910 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P910 defio_error_P910_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P910 DEFIO_TAG_E__NONE
# define DEFIO_REC__P910 defio_error_P910_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(11)
# define DEFIO_TAG__P911 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 11)
# define DEFIO_TAG_E__P911 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 11)
# define DEFIO_REC__P911 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P911 defio_error_P911_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P911 DEFIO_TAG_E__NONE
# define DEFIO_REC__P911 defio_error_P911_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(12)
# define DEFIO_TAG__P912 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 12)
# define DEFIO_TAG_E__P912 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 12)
# define DEFIO_REC__P912 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P912 defio_error_P912_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P912 DEFIO_TAG_E__NONE
# define DEFIO_REC__P912 defio_error_P912_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(13)
# define DEFIO_TAG__P913 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 13)
# define DEFIO_TAG_E__P913 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 13)
# define DEFIO_REC__P913 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P913 defio_error_P913_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P913 DEFIO_TAG_E__NONE
# define DEFIO_REC__P913 defio_error_P913_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(14)
# define DEFIO_TAG__P914 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 14)
# define DEFIO_TAG_E__P914 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 14)
# define DEFIO_REC__P914 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P914 defio_error_P914_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P914 DEFIO_TAG_E__NONE
# define DEFIO_REC__P914 defio_error_P914_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_9_USED_MASK & BIT(15)
# define DEFIO_TAG__P915 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 15)
# define DEFIO_TAG_E__P915 DEFIO_TAG_MAKE(DEFIO_GPIOID__9, 15)
# define DEFIO_REC__P915 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_9_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT)
#else
# define DEFIO_TAG__P915 defio_error_P915_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P915 DEFIO_TAG_E__NONE
# define DEFIO_REC__P915 defio_error_P915_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(0)
# define DEFIO_TAG__P140 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 0)
# define DEFIO_TAG_E__P140 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 0)
# define DEFIO_REC__P140 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P140 defio_error_P140_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P140 DEFIO_TAG_E__NONE
# define DEFIO_REC__P140 defio_error_P140_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(1)
# define DEFIO_TAG__P141 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 1)
# define DEFIO_TAG_E__P141 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 1)
# define DEFIO_REC__P141 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P141 defio_error_P141_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P141 DEFIO_TAG_E__NONE
# define DEFIO_REC__P141 defio_error_P141_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(2)
# define DEFIO_TAG__P142 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 2)
# define DEFIO_TAG_E__P142 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 2)
# define DEFIO_REC__P142 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P142 defio_error_P142_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P142 DEFIO_TAG_E__NONE
# define DEFIO_REC__P142 defio_error_P142_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(3)
# define DEFIO_TAG__P143 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 3)
# define DEFIO_TAG_E__P143 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 3)
# define DEFIO_REC__P143 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P143 defio_error_P143_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P143 DEFIO_TAG_E__NONE
# define DEFIO_REC__P143 defio_error_P143_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(4)
# define DEFIO_TAG__P144 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 4)
# define DEFIO_TAG_E__P144 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 4)
# define DEFIO_REC__P144 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P144 defio_error_P144_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P144 DEFIO_TAG_E__NONE
