ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
# define DEFIO_REC__P144 defio_error_P144_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(5)
# define DEFIO_TAG__P145 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 5)
# define DEFIO_TAG_E__P145 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 5)
# define DEFIO_REC__P145 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P145 defio_error_P145_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P145 DEFIO_TAG_E__NONE
# define DEFIO_REC__P145 defio_error_P145_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(6)
# define DEFIO_TAG__P146 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 6)
# define DEFIO_TAG_E__P146 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 6)
# define DEFIO_REC__P146 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P146 defio_error_P146_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P146 DEFIO_TAG_E__NONE
# define DEFIO_REC__P146 defio_error_P146_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(7)
# define DEFIO_TAG__P147 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 7)
# define DEFIO_TAG_E__P147 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 7)
# define DEFIO_REC__P147 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P147 defio_error_P147_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P147 DEFIO_TAG_E__NONE
# define DEFIO_REC__P147 defio_error_P147_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(8)
# define DEFIO_TAG__P148 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 8)
# define DEFIO_TAG_E__P148 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 8)
# define DEFIO_REC__P148 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P148 defio_error_P148_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P148 DEFIO_TAG_E__NONE
# define DEFIO_REC__P148 defio_error_P148_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(9)
# define DEFIO_TAG__P149 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 9)
# define DEFIO_TAG_E__P149 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 9)
# define DEFIO_REC__P149 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P149 defio_error_P149_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P149 DEFIO_TAG_E__NONE
# define DEFIO_REC__P149 defio_error_P149_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(10)
# define DEFIO_TAG__P1410 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 10)
# define DEFIO_TAG_E__P1410 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 10)
# define DEFIO_REC__P1410 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P1410 defio_error_P1410_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1410 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1410 defio_error_P1410_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(11)
# define DEFIO_TAG__P1411 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 11)
# define DEFIO_TAG_E__P1411 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 11)
# define DEFIO_REC__P1411 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P1411 defio_error_P1411_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1411 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1411 defio_error_P1411_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(12)
# define DEFIO_TAG__P1412 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 12)
# define DEFIO_TAG_E__P1412 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 12)
# define DEFIO_REC__P1412 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P1412 defio_error_P1412_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1412 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1412 defio_error_P1412_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(13)
# define DEFIO_TAG__P1413 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 13)
# define DEFIO_TAG_E__P1413 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 13)
# define DEFIO_REC__P1413 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P1413 defio_error_P1413_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1413 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1413 defio_error_P1413_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(14)
# define DEFIO_TAG__P1414 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 14)
# define DEFIO_TAG_E__P1414 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 14)
# define DEFIO_REC__P1414 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P1414 defio_error_P1414_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1414 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1414 defio_error_P1414_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_14_USED_MASK & BIT(15)
# define DEFIO_TAG__P1415 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 15)
# define DEFIO_TAG_E__P1415 DEFIO_TAG_MAKE(DEFIO_GPIOID__14, 15)
# define DEFIO_REC__P1415 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_14_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT)
#else
# define DEFIO_TAG__P1415 defio_error_P1415_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1415 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1415 defio_error_P1415_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(0)
# define DEFIO_TAG__P150 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 0)
# define DEFIO_TAG_E__P150 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 0)
# define DEFIO_REC__P150 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P150 defio_error_P150_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P150 DEFIO_TAG_E__NONE
# define DEFIO_REC__P150 defio_error_P150_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(1)
# define DEFIO_TAG__P151 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 1)
# define DEFIO_TAG_E__P151 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 1)
# define DEFIO_REC__P151 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P151 defio_error_P151_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P151 DEFIO_TAG_E__NONE
# define DEFIO_REC__P151 defio_error_P151_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(2)
# define DEFIO_TAG__P152 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 2)
# define DEFIO_TAG_E__P152 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 2)
# define DEFIO_REC__P152 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P152 defio_error_P152_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P152 DEFIO_TAG_E__NONE
# define DEFIO_REC__P152 defio_error_P152_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(3)
# define DEFIO_TAG__P153 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 3)
# define DEFIO_TAG_E__P153 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 3)
# define DEFIO_REC__P153 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P153 defio_error_P153_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P153 DEFIO_TAG_E__NONE
# define DEFIO_REC__P153 defio_error_P153_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(4)
# define DEFIO_TAG__P154 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 4)
# define DEFIO_TAG_E__P154 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 4)
# define DEFIO_REC__P154 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P154 defio_error_P154_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P154 DEFIO_TAG_E__NONE
# define DEFIO_REC__P154 defio_error_P154_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(5)
# define DEFIO_TAG__P155 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 5)
# define DEFIO_TAG_E__P155 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 5)
# define DEFIO_REC__P155 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P155 defio_error_P155_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P155 DEFIO_TAG_E__NONE
# define DEFIO_REC__P155 defio_error_P155_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(6)
# define DEFIO_TAG__P156 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 6)
# define DEFIO_TAG_E__P156 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 6)
# define DEFIO_REC__P156 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P156 defio_error_P156_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P156 DEFIO_TAG_E__NONE
# define DEFIO_REC__P156 defio_error_P156_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(7)
# define DEFIO_TAG__P157 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 7)
# define DEFIO_TAG_E__P157 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 7)
# define DEFIO_REC__P157 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P157 defio_error_P157_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P157 DEFIO_TAG_E__NONE
# define DEFIO_REC__P157 defio_error_P157_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(8)
# define DEFIO_TAG__P158 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 8)
# define DEFIO_TAG_E__P158 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 8)
# define DEFIO_REC__P158 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P158 defio_error_P158_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P158 DEFIO_TAG_E__NONE
# define DEFIO_REC__P158 defio_error_P158_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(9)
# define DEFIO_TAG__P159 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 9)
# define DEFIO_TAG_E__P159 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 9)
# define DEFIO_REC__P159 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P159 defio_error_P159_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P159 DEFIO_TAG_E__NONE
# define DEFIO_REC__P159 defio_error_P159_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(10)
# define DEFIO_TAG__P1510 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 10)
# define DEFIO_TAG_E__P1510 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 10)
# define DEFIO_REC__P1510 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P1510 defio_error_P1510_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1510 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1510 defio_error_P1510_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(11)
# define DEFIO_TAG__P1511 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 11)
# define DEFIO_TAG_E__P1511 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 11)
# define DEFIO_REC__P1511 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P1511 defio_error_P1511_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1511 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1511 defio_error_P1511_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(12)
# define DEFIO_TAG__P1512 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 12)
# define DEFIO_TAG_E__P1512 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 12)
# define DEFIO_REC__P1512 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P1512 defio_error_P1512_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1512 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1512 defio_error_P1512_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(13)
# define DEFIO_TAG__P1513 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 13)
# define DEFIO_TAG_E__P1513 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 13)
# define DEFIO_REC__P1513 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P1513 defio_error_P1513_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1513 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1513 defio_error_P1513_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(14)
# define DEFIO_TAG__P1514 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 14)
# define DEFIO_TAG_E__P1514 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 14)
# define DEFIO_REC__P1514 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P1514 defio_error_P1514_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1514 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1514 defio_error_P1514_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_15_USED_MASK & BIT(15)
# define DEFIO_TAG__P1515 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 15)
# define DEFIO_TAG_E__P1515 DEFIO_TAG_MAKE(DEFIO_GPIOID__15, 15)
# define DEFIO_REC__P1515 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_15_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT)
#else
# define DEFIO_TAG__P1515 defio_error_P1515_is_not_supported_on_TARGET
# define DEFIO_TAG_E__P1515 DEFIO_TAG_E__NONE
# define DEFIO_REC__P1515 defio_error_P1515_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(0)
# define DEFIO_TAG__PA0 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 0)
# define DEFIO_TAG_E__PA0 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 0)
# define DEFIO_REC__PA0 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA0 defio_error_PA0_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA0 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA0 defio_error_PA0_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(1)
# define DEFIO_TAG__PA1 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 1)
# define DEFIO_TAG_E__PA1 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 1)
# define DEFIO_REC__PA1 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA1 defio_error_PA1_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA1 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA1 defio_error_PA1_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(2)
# define DEFIO_TAG__PA2 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 2)
# define DEFIO_TAG_E__PA2 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 2)
# define DEFIO_REC__PA2 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA2 defio_error_PA2_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA2 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA2 defio_error_PA2_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(3)
# define DEFIO_TAG__PA3 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 3)
# define DEFIO_TAG_E__PA3 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 3)
# define DEFIO_REC__PA3 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA3 defio_error_PA3_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA3 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA3 defio_error_PA3_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(4)
# define DEFIO_TAG__PA4 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 4)
# define DEFIO_TAG_E__PA4 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 4)
# define DEFIO_REC__PA4 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA4 defio_error_PA4_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA4 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA4 defio_error_PA4_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(5)
# define DEFIO_TAG__PA5 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 5)
# define DEFIO_TAG_E__PA5 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 5)
# define DEFIO_REC__PA5 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA5 defio_error_PA5_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA5 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA5 defio_error_PA5_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(6)
# define DEFIO_TAG__PA6 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 6)
# define DEFIO_TAG_E__PA6 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 6)
