ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
# define DEFIO_REC__PA6 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA6 defio_error_PA6_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA6 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA6 defio_error_PA6_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(7)
# define DEFIO_TAG__PA7 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 7)
# define DEFIO_TAG_E__PA7 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 7)
# define DEFIO_REC__PA7 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA7 defio_error_PA7_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA7 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA7 defio_error_PA7_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(8)
# define DEFIO_TAG__PA8 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 8)
# define DEFIO_TAG_E__PA8 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 8)
# define DEFIO_REC__PA8 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA8 defio_error_PA8_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA8 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA8 defio_error_PA8_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(9)
# define DEFIO_TAG__PA9 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 9)
# define DEFIO_TAG_E__PA9 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 9)
# define DEFIO_REC__PA9 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA9 defio_error_PA9_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA9 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA9 defio_error_PA9_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(10)
# define DEFIO_TAG__PA10 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 10)
# define DEFIO_TAG_E__PA10 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 10)
# define DEFIO_REC__PA10 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA10 defio_error_PA10_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA10 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA10 defio_error_PA10_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(11)
# define DEFIO_TAG__PA11 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 11)
# define DEFIO_TAG_E__PA11 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 11)
# define DEFIO_REC__PA11 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA11 defio_error_PA11_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA11 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA11 defio_error_PA11_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(12)
# define DEFIO_TAG__PA12 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 12)
# define DEFIO_TAG_E__PA12 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 12)
# define DEFIO_REC__PA12 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA12 defio_error_PA12_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA12 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA12 defio_error_PA12_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(13)
# define DEFIO_TAG__PA13 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 13)
# define DEFIO_TAG_E__PA13 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 13)
# define DEFIO_REC__PA13 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA13 defio_error_PA13_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA13 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA13 defio_error_PA13_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(14)
# define DEFIO_TAG__PA14 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 14)
# define DEFIO_TAG_E__PA14 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 14)
# define DEFIO_REC__PA14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA14 defio_error_PA14_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA14 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA14 defio_error_PA14_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_A_USED_MASK & BIT(15)
# define DEFIO_TAG__PA15 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 15)
# define DEFIO_TAG_E__PA15 DEFIO_TAG_MAKE(DEFIO_GPIOID__A, 15)
# define DEFIO_REC__PA15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_A_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT)
#else
# define DEFIO_TAG__PA15 defio_error_PA15_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PA15 DEFIO_TAG_E__NONE
# define DEFIO_REC__PA15 defio_error_PA15_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(0)
# define DEFIO_TAG__PB0 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 0)
# define DEFIO_TAG_E__PB0 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 0)
# define DEFIO_REC__PB0 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB0 defio_error_PB0_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB0 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB0 defio_error_PB0_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(1)
# define DEFIO_TAG__PB1 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 1)
# define DEFIO_TAG_E__PB1 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 1)
# define DEFIO_REC__PB1 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB1 defio_error_PB1_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB1 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB1 defio_error_PB1_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(2)
# define DEFIO_TAG__PB2 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 2)
# define DEFIO_TAG_E__PB2 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 2)
# define DEFIO_REC__PB2 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB2 defio_error_PB2_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB2 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB2 defio_error_PB2_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(3)
# define DEFIO_TAG__PB3 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 3)
# define DEFIO_TAG_E__PB3 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 3)
# define DEFIO_REC__PB3 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB3 defio_error_PB3_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB3 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB3 defio_error_PB3_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(4)
# define DEFIO_TAG__PB4 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 4)
# define DEFIO_TAG_E__PB4 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 4)
# define DEFIO_REC__PB4 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB4 defio_error_PB4_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB4 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB4 defio_error_PB4_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(5)
# define DEFIO_TAG__PB5 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 5)
# define DEFIO_TAG_E__PB5 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 5)
# define DEFIO_REC__PB5 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB5 defio_error_PB5_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB5 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB5 defio_error_PB5_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(6)
# define DEFIO_TAG__PB6 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 6)
# define DEFIO_TAG_E__PB6 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 6)
# define DEFIO_REC__PB6 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB6 defio_error_PB6_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB6 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB6 defio_error_PB6_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(7)
# define DEFIO_TAG__PB7 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 7)
# define DEFIO_TAG_E__PB7 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 7)
# define DEFIO_REC__PB7 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB7 defio_error_PB7_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB7 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB7 defio_error_PB7_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(8)
# define DEFIO_TAG__PB8 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 8)
# define DEFIO_TAG_E__PB8 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 8)
# define DEFIO_REC__PB8 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB8 defio_error_PB8_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB8 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB8 defio_error_PB8_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(9)
# define DEFIO_TAG__PB9 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 9)
# define DEFIO_TAG_E__PB9 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 9)
# define DEFIO_REC__PB9 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB9 defio_error_PB9_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB9 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB9 defio_error_PB9_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(10)
# define DEFIO_TAG__PB10 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 10)
# define DEFIO_TAG_E__PB10 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 10)
# define DEFIO_REC__PB10 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB10 defio_error_PB10_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB10 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB10 defio_error_PB10_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(11)
# define DEFIO_TAG__PB11 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 11)
# define DEFIO_TAG_E__PB11 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 11)
# define DEFIO_REC__PB11 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB11 defio_error_PB11_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB11 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB11 defio_error_PB11_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(12)
# define DEFIO_TAG__PB12 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 12)
# define DEFIO_TAG_E__PB12 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 12)
# define DEFIO_REC__PB12 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB12 defio_error_PB12_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB12 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB12 defio_error_PB12_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(13)
# define DEFIO_TAG__PB13 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 13)
# define DEFIO_TAG_E__PB13 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 13)
# define DEFIO_REC__PB13 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB13 defio_error_PB13_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB13 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB13 defio_error_PB13_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(14)
# define DEFIO_TAG__PB14 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 14)
# define DEFIO_TAG_E__PB14 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 14)
# define DEFIO_REC__PB14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB14 defio_error_PB14_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB14 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB14 defio_error_PB14_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_B_USED_MASK & BIT(15)
# define DEFIO_TAG__PB15 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 15)
# define DEFIO_TAG_E__PB15 DEFIO_TAG_MAKE(DEFIO_GPIOID__B, 15)
# define DEFIO_REC__PB15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_B_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT)
#else
# define DEFIO_TAG__PB15 defio_error_PB15_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PB15 DEFIO_TAG_E__NONE
# define DEFIO_REC__PB15 defio_error_PB15_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_C_USED_MASK & BIT(0)
# define DEFIO_TAG__PC0 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 0)
# define DEFIO_TAG_E__PC0 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 0)
# define DEFIO_REC__PC0 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_C_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT)
#else
# define DEFIO_TAG__PC0 defio_error_PC0_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PC0 DEFIO_TAG_E__NONE
# define DEFIO_REC__PC0 defio_error_PC0_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_C_USED_MASK & BIT(1)
# define DEFIO_TAG__PC1 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 1)
# define DEFIO_TAG_E__PC1 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 1)
# define DEFIO_REC__PC1 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_C_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT)
#else
# define DEFIO_TAG__PC1 defio_error_PC1_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PC1 DEFIO_TAG_E__NONE
# define DEFIO_REC__PC1 defio_error_PC1_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_C_USED_MASK & BIT(2)
# define DEFIO_TAG__PC2 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 2)
# define DEFIO_TAG_E__PC2 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 2)
# define DEFIO_REC__PC2 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_C_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT)
#else
# define DEFIO_TAG__PC2 defio_error_PC2_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PC2 DEFIO_TAG_E__NONE
# define DEFIO_REC__PC2 defio_error_PC2_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_C_USED_MASK & BIT(3)
# define DEFIO_TAG__PC3 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 3)
# define DEFIO_TAG_E__PC3 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 3)
# define DEFIO_REC__PC3 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_C_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT)
#else
# define DEFIO_TAG__PC3 defio_error_PC3_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PC3 DEFIO_TAG_E__NONE
# define DEFIO_REC__PC3 defio_error_PC3_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_C_USED_MASK & BIT(4)
# define DEFIO_TAG__PC4 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 4)
# define DEFIO_TAG_E__PC4 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 4)
# define DEFIO_REC__PC4 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_C_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT)
#else
# define DEFIO_TAG__PC4 defio_error_PC4_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PC4 DEFIO_TAG_E__NONE
# define DEFIO_REC__PC4 defio_error_PC4_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_C_USED_MASK & BIT(5)
# define DEFIO_TAG__PC5 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 5)
# define DEFIO_TAG_E__PC5 DEFIO_TAG_MAKE(DEFIO_GPIOID__C, 5)
# define DEFIO_REC__PC5 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_C_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT)
#else
# define DEFIO_TAG__PC5 defio_error_PC5_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PC5 DEFIO_TAG_E__NONE
