ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
# define DEFIO_REC__PG0 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(0) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG0 defio_error_PG0_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG0 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG0 defio_error_PG0_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(1)
# define DEFIO_TAG__PG1 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 1)
# define DEFIO_TAG_E__PG1 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 1)
# define DEFIO_REC__PG1 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(1) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG1 defio_error_PG1_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG1 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG1 defio_error_PG1_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(2)
# define DEFIO_TAG__PG2 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 2)
# define DEFIO_TAG_E__PG2 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 2)
# define DEFIO_REC__PG2 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(2) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG2 defio_error_PG2_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG2 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG2 defio_error_PG2_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(3)
# define DEFIO_TAG__PG3 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 3)
# define DEFIO_TAG_E__PG3 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 3)
# define DEFIO_REC__PG3 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(3) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG3 defio_error_PG3_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG3 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG3 defio_error_PG3_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(4)
# define DEFIO_TAG__PG4 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 4)
# define DEFIO_TAG_E__PG4 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 4)
# define DEFIO_REC__PG4 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(4) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG4 defio_error_PG4_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG4 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG4 defio_error_PG4_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(5)
# define DEFIO_TAG__PG5 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 5)
# define DEFIO_TAG_E__PG5 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 5)
# define DEFIO_REC__PG5 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(5) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG5 defio_error_PG5_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG5 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG5 defio_error_PG5_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(6)
# define DEFIO_TAG__PG6 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 6)
# define DEFIO_TAG_E__PG6 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 6)
# define DEFIO_REC__PG6 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(6) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG6 defio_error_PG6_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG6 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG6 defio_error_PG6_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(7)
# define DEFIO_TAG__PG7 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 7)
# define DEFIO_TAG_E__PG7 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 7)
# define DEFIO_REC__PG7 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(7) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG7 defio_error_PG7_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG7 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG7 defio_error_PG7_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(8)
# define DEFIO_TAG__PG8 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 8)
# define DEFIO_TAG_E__PG8 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 8)
# define DEFIO_REC__PG8 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(8) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG8 defio_error_PG8_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG8 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG8 defio_error_PG8_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(9)
# define DEFIO_TAG__PG9 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 9)
# define DEFIO_TAG_E__PG9 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 9)
# define DEFIO_REC__PG9 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG9 defio_error_PG9_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG9 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG9 defio_error_PG9_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(10)
# define DEFIO_TAG__PG10 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 10)
# define DEFIO_TAG_E__PG10 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 10)
# define DEFIO_REC__PG10 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG10 defio_error_PG10_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG10 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG10 defio_error_PG10_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(11)
# define DEFIO_TAG__PG11 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 11)
# define DEFIO_TAG_E__PG11 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 11)
# define DEFIO_REC__PG11 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG11 defio_error_PG11_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG11 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG11 defio_error_PG11_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(12)
# define DEFIO_TAG__PG12 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 12)
# define DEFIO_TAG_E__PG12 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 12)
# define DEFIO_REC__PG12 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG12 defio_error_PG12_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG12 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG12 defio_error_PG12_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(13)
# define DEFIO_TAG__PG13 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 13)
# define DEFIO_TAG_E__PG13 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 13)
# define DEFIO_REC__PG13 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG13 defio_error_PG13_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG13 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG13 defio_error_PG13_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(14)
# define DEFIO_TAG__PG14 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 14)
# define DEFIO_TAG_E__PG14 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 14)
# define DEFIO_REC__PG14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG14 defio_error_PG14_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG14 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG14 defio_error_PG14_is_not_supported_on_TARGET
#endif
#if DEFIO_PORT_G_USED_MASK & BIT(15)
# define DEFIO_TAG__PG15 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 15)
# define DEFIO_TAG_E__PG15 DEFIO_TAG_MAKE(DEFIO_GPIOID__G, 15)
# define DEFIO_REC__PG15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_G_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT)
#else
# define DEFIO_TAG__PG15 defio_error_PG15_is_not_supported_on_TARGET
# define DEFIO_TAG_E__PG15 DEFIO_TAG_E__NONE
# define DEFIO_REC__PG15 defio_error_PG15_is_not_supported_on_TARGET
#endif

// DEFIO_IO_USED_COUNT is number of io pins supported on target
#define DEFIO_IO_USED_COUNT (DEFIO_PORT_0_USED_COUNT+DEFIO_PORT_1_USED_COUNT+DEFIO_PORT_2_USED_COUNT+DEFIO_PORT_3_USED_COUNT+DEFIO_PORT_4_USED_COUNT+DEFIO_PORT_5_USED_COUNT+DEFIO_PORT_6_USED_COUNT+DEFIO_PORT_7_USED_COUNT+DEFIO_PORT_8_USED_COUNT+DEFIO_PORT_9_USED_COUNT+DEFIO_PORT_14_USED_COUNT+DEFIO_PORT_15_USED_COUNT+DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT)

