ManagementCenterInnsbruck/Cleanflight_XMC4700/cleanflight/src/main/drivers/io_def_generated.h
// DEFIO_PORT_USED_LIST - comma separated list of bitmask for all used ports.
// DEFIO_PORT_OFFSET_LIST - comma separated list of port offsets (count of pins before this port)
// unused ports on end of list are skipped
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_G_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 19
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK,DEFIO_PORT_A_USED_MASK,DEFIO_PORT_B_USED_MASK,DEFIO_PORT_C_USED_MASK,DEFIO_PORT_D_USED_MASK,DEFIO_PORT_E_USED_MASK,DEFIO_PORT_F_USED_MASK,DEFIO_PORT_G_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET,DEFIO_PORT_A_OFFSET,DEFIO_PORT_B_OFFSET,DEFIO_PORT_C_OFFSET,DEFIO_PORT_D_OFFSET,DEFIO_PORT_E_OFFSET,DEFIO_PORT_F_OFFSET,DEFIO_PORT_G_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_F_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 18
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK,DEFIO_PORT_A_USED_MASK,DEFIO_PORT_B_USED_MASK,DEFIO_PORT_C_USED_MASK,DEFIO_PORT_D_USED_MASK,DEFIO_PORT_E_USED_MASK,DEFIO_PORT_F_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET,DEFIO_PORT_A_OFFSET,DEFIO_PORT_B_OFFSET,DEFIO_PORT_C_OFFSET,DEFIO_PORT_D_OFFSET,DEFIO_PORT_E_OFFSET,DEFIO_PORT_F_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_E_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 17
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK,DEFIO_PORT_A_USED_MASK,DEFIO_PORT_B_USED_MASK,DEFIO_PORT_C_USED_MASK,DEFIO_PORT_D_USED_MASK,DEFIO_PORT_E_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET,DEFIO_PORT_A_OFFSET,DEFIO_PORT_B_OFFSET,DEFIO_PORT_C_OFFSET,DEFIO_PORT_D_OFFSET,DEFIO_PORT_E_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_D_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 16
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK,DEFIO_PORT_A_USED_MASK,DEFIO_PORT_B_USED_MASK,DEFIO_PORT_C_USED_MASK,DEFIO_PORT_D_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET,DEFIO_PORT_A_OFFSET,DEFIO_PORT_B_OFFSET,DEFIO_PORT_C_OFFSET,DEFIO_PORT_D_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_C_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 15
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK,DEFIO_PORT_A_USED_MASK,DEFIO_PORT_B_USED_MASK,DEFIO_PORT_C_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET,DEFIO_PORT_A_OFFSET,DEFIO_PORT_B_OFFSET,DEFIO_PORT_C_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_B_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 14
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK,DEFIO_PORT_A_USED_MASK,DEFIO_PORT_B_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET,DEFIO_PORT_A_OFFSET,DEFIO_PORT_B_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_A_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 13
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK,DEFIO_PORT_A_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET,DEFIO_PORT_A_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_15_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 12
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK,DEFIO_PORT_15_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET,DEFIO_PORT_15_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_14_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 11
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK,DEFIO_PORT_14_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET,DEFIO_PORT_14_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_9_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 10
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK,DEFIO_PORT_9_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET,DEFIO_PORT_9_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_8_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 9
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK,DEFIO_PORT_8_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET,DEFIO_PORT_8_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_7_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 8
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK,DEFIO_PORT_7_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET,DEFIO_PORT_7_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_6_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 7
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK,DEFIO_PORT_6_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET,DEFIO_PORT_6_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_5_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 6
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK,DEFIO_PORT_5_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET,DEFIO_PORT_5_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_4_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 5
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK,DEFIO_PORT_4_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET,DEFIO_PORT_4_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_3_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 4
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK,DEFIO_PORT_3_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET,DEFIO_PORT_3_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_2_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 3
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK,DEFIO_PORT_2_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET,DEFIO_PORT_2_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_1_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 2
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK,DEFIO_PORT_1_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET,DEFIO_PORT_1_OFFSET
#endif
#if !defined DEFIO_PORT_USED_LIST && DEFIO_PORT_0_USED_COUNT > 0
# define DEFIO_PORT_USED_COUNT 1
# define DEFIO_PORT_USED_LIST DEFIO_PORT_0_USED_MASK
# define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_0_OFFSET
#endif

#if !defined(DEFIO_PORT_USED_LIST)
# if !defined DEFIO_NO_PORTS   // supress warnings if we really don't want any pins
#  warning "No pins are defined. Maybe you forgot to define TARGET_IO_PORTx in target.h"
# endif
# define DEFIO_PORT_USED_COUNT 0
# define DEFIO_PORT_USED_LIST /* empty */
# define DEFIO_PORT_OFFSET_LIST /* empty */
#endif

